In [ ]:
import numpy as np
import pandas as pd

from pandas import Series, DataFrame

# Indexing

In [ ]:
ser1 = Series([1,2,3,4],index=['A','B','C','D'])
ser1

In [ ]:
ser1.index

In [ ]:
my_index = ser1.index

In [ ]:
my_index[3]

In [ ]:
# Index is mutable so we cant change its value
my_index[3] = 'A'

In [ ]:
ser2 = ser1.reindex(['A','B','C','D','E','F'])
ser2

In [ ]:
ser2 = ser2.reindex(['A','B','C','D','E','F','G'],fill_value=0)
ser2

In [ ]:
ser3 = Series(['USA','Mexico','Canada'],index=[0,5,10])

ser3

In [ ]:
ranger = range(15)
ranger

In [ ]:
ser3.reindex(ranger,method='ffill')

In [ ]:
dframe = DataFrame(np.random.randn(25).reshape((5,5)),index=['A','B','C','D','E'],
        columns=['col1','col2','col3','col4','col5'])
dframe

In [17]:
dframe2 = dframe.reindex(['A','B','C','D','E','F'])
dframe2

       col1      col2      col3      col4      col5
A  1.227427 -1.338026  0.422651 -1.351106  0.444727
B  0.914960  3.152245 -0.258418  0.741324  0.311089
C -0.835869 -1.018515 -0.240161  0.465603  0.124717
D -2.099011 -0.038048  0.449388  0.028096  0.916035
E -0.626277  1.920955 -0.056032  0.551695 -0.689791
F       NaN       NaN       NaN       NaN       NaN

In [ ]:
new_columns = ['col1','col2','col3','col4','col5','col6']

In [ ]:
dframe2.reindex(columns=new_columns)

# Drop entries

In [22]:
ser1 = Series(np.arange(3),index=['a','b','c'])
ser1

a    0
b    1
c    2
dtype: int64

In [24]:
ser1.drop('b')

a    0
c    2
dtype: int64

In [27]:
dframe1 = DataFrame(np.arange(9).reshape(3,3),index=['SF','LA','NY'],columns=['pop','size','year'])
dframe1

    pop  size  year
SF    0     1     2
LA    3     4     5
NY    6     7     8

In [28]:
dframe2 = dframe1.drop('LA')
dframe2

    pop  size  year
SF    0     1     2
NY    6     7     8

In [29]:
dframe1.drop('year',axis=1)

    pop  size
SF    0     1
LA    3     4
NY    6     7

# Select entry

In [30]:
ser1 = Series(np.arange(3),index=['a','b','c'])
ser1 = 2*ser1
ser1

a    0
b    2
c    4
dtype: int64

In [31]:
ser1['b']

2

In [32]:
ser1[1]

2

In [33]:
ser1[[1,2]]

b    2
c    4
dtype: int64

In [34]:
ser1[:2]

a    0
b    2
dtype: int64

In [35]:
ser1[['a','b']]

a    0
b    2
dtype: int64

In [36]:
ser1[ser1>3]

c    4
dtype: int64

In [37]:
ser1[ser1>3] = 10
ser1

In [40]:
dframe = DataFrame(np.arange(25).reshape((5,5)),index=['NYC','LA','SF','DC','Chi'],
                  columns=['A','B','C','D','E'])
dframe

      A   B   C   D   E
NYC   0   1   2   3   4
LA    5   6   7   8   9
SF   10  11  12  13  14
DC   15  16  17  18  19
Chi  20  21  22  23  24

In [41]:
dframe['B']

NYC     1
LA      6
SF     11
DC     16
Chi    21
Name: B, dtype: int64

In [42]:
dframe[['B','E']]

      B   E
NYC   1   4
LA    6   9
SF   11  14
DC   16  19
Chi  21  24

In [43]:
dframe[dframe['C']>8]

      A   B   C   D   E
SF   10  11  12  13  14
DC   15  16  17  18  19
Chi  20  21  22  23  24

In [44]:
dframe>10

         A      B      C      D      E
NYC  False  False  False  False  False
LA   False  False  False  False  False
SF   False   True   True   True   True
DC    True   True   True   True   True
Chi   True   True   True   True   True

In [46]:
dframe.loc['LA']

A    5
B    6
C    7
D    8
E    9
Name: LA, dtype: int64